Autodesk.Revit.DB.FormatValueOptions.AreValidForUnitType(Autodesk.Revit.DB.UnitType)
Checks whether the FormatOptions in this FormatValueOptions is valid for a given unit type.
Remarks:
The FormatOptions is valid if UseDefault is true or if the display
unit in the FormatOptions is valid for the unit type.  See
UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType)
and
UnitUtils.GetValidDisplayUnits(UnitType).
unitType:
The unit type.
Returns:
True if the FormatOptions is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
unitType is an invalid unit type.  See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes().
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014